podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/TRGMUX_S32K146.svd.xml
            <register>
               <name>TRGMUX_PDB1</name>
               <description>TRGMUX PDB1 Register</description>
               <addressOffset>0x3C</addressOffset>
               <fields>
                  <field>
                     <name>SEL0</name>
                     <description>Trigger MUX Input 0 Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>LK</name>
                     <description>TRGMUX register lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Register can be written</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Register cannot be written until the next system Reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRGMUX_FLEXIO</name>
               <description>TRGMUX FLEXIO Register</description>
               <addressOffset>0x44</addressOffset>
               <fields>
                  <field>
                     <name>SEL0</name>
                     <description>Trigger MUX Input 0 Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SEL1</name>
                     <description>Trigger MUX Input 1 Source Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SEL2</name>
                     <description>Trigger MUX Input 2 Source Select</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SEL3</name>
                     <description>Trigger MUX Input 3 Source Select</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>LK</name>
                     <description>TRGMUX register lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Register can be written</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Register cannot be written until the next system Reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRGMUX_LPIT0</name>
               <description>TRGMUX LPIT0 Register</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>SEL0</name>
                     <description>Trigger MUX Input 0 Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SEL1</name>
                     <description>Trigger MUX Input 1 Source Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SEL2</name>
                     <description>Trigger MUX Input 2 Source Select</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SEL3</name>
                     <description>Trigger MUX Input 3 Source Select</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>LK</name>
                     <description>TRGMUX register lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Register can be written</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Register cannot be written until the next system Reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRGMUX_LPUART0</name>
               <description>TRGMUX LPUART0 Register</description>
               <addressOffset>0x4C</addressOffset>
               <fields>
                  <field>
                     <name>SEL0</name>
                     <description>Trigger MUX Input 0 Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>LK</name>
                     <description>TRGMUX register lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Register can be written</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Register cannot be written until the next system Reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRGMUX_LPUART1</name>
               <description>TRGMUX LPUART1 Register</description>
               <addressOffset>0x50</addressOffset>
               <fields>
                  <field>
                     <name>SEL0</name>
                     <description>Trigger MUX Input 0 Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>LK</name>
                     <description>TRGMUX register lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Register can be written</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Register cannot be written until the next system Reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRGMUX_LPI2C0</name>
               <description>TRGMUX LPI2C0 Register</description>
               <addressOffset>0x54</addressOffset>
               <fields>
                  <field>
                     <name>SEL0</name>
                     <description>Trigger MUX Input 0 Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>LK</name>
                     <description>TRGMUX register lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Register can be written</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Register cannot be written until the next system Reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRGMUX_LPSPI0</name>
               <description>TRGMUX LPSPI0 Register</description>
               <addressOffset>0x5C</addressOffset>
               <fields>
                  <field>
                     <name>SEL0</name>
                     <description>Trigger MUX Input 0 Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>LK</name>
                     <description>TRGMUX register lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Register can be written</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Register cannot be written until the next system Reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRGMUX_LPSPI1</name>
               <description>TRGMUX LPSPI1 Register</description>
               <addressOffset>0x60</addressOffset>
               <fields>
                  <field>
                     <name>SEL0</name>
                     <description>Trigger MUX Input 0 Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>LK</name>
                     <description>TRGMUX register lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Register can be written</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Register cannot be written until the next system Reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRGMUX_LPTMR0</name>
               <description>TRGMUX LPTMR0 Register</description>
               <addressOffset>0x64</addressOffset>
               <fields>
                  <field>
                     <name>SEL0</name>
                     <description>Trigger MUX Input 0 Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>LK</name>
                     <description>TRGMUX register lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Register can be written</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Register cannot be written until the next system Reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRGMUX_FTM4</name>
               <description>TRGMUX FTM4 Register</description>
               <addressOffset>0x70</addressOffset>
               <fields>
                  <field>
                     <name>SEL0</name>
                     <description>Trigger MUX Input 0 Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>LK</name>
                     <description>TRGMUX register lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Register can be written</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Register cannot be written until the next system Reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRGMUX_FTM5</name>
               <description>TRGMUX FTM5 Register</description>
               <addressOffset>0x74</addressOffset>
               <fields>
                  <field>
                     <name>SEL0</name>
                     <description>Trigger MUX Input 0 Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>LK</name>
                     <description>TRGMUX register lock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Register can be written</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Register cannot be written until the next system Reset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
